###############################################################################
# Created by write_sdc
###############################################################################
current_design mbist_ctrl
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 20.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_dout[0]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_dout[1]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_dout[2]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_dout[3]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_dout[4]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_dout[5]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_dout[6]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_dout[7]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {start}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {diag_addr[0]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {diag_addr[1]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {diag_addr[2]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {diag_addr[3]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {diag_addr[4]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {diag_addr[5]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {diag_addr[6]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {diag_addr[7]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {done}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[0]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[1]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[2]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[3]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[4]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[5]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[6]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_addr[7]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_ce}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_din[0]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_din[1]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_din[2]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_din[3]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_din[4]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_din[5]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_din[6]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_din[7]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_we}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pass_fail}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {done}]
set_load -pin_load 0.0334 [get_ports {mem_ce}]
set_load -pin_load 0.0334 [get_ports {mem_we}]
set_load -pin_load 0.0334 [get_ports {pass_fail}]
set_load -pin_load 0.0334 [get_ports {diag_addr[7]}]
set_load -pin_load 0.0334 [get_ports {diag_addr[6]}]
set_load -pin_load 0.0334 [get_ports {diag_addr[5]}]
set_load -pin_load 0.0334 [get_ports {diag_addr[4]}]
set_load -pin_load 0.0334 [get_ports {diag_addr[3]}]
set_load -pin_load 0.0334 [get_ports {diag_addr[2]}]
set_load -pin_load 0.0334 [get_ports {diag_addr[1]}]
set_load -pin_load 0.0334 [get_ports {diag_addr[0]}]
set_load -pin_load 0.0334 [get_ports {mem_addr[7]}]
set_load -pin_load 0.0334 [get_ports {mem_addr[6]}]
set_load -pin_load 0.0334 [get_ports {mem_addr[5]}]
set_load -pin_load 0.0334 [get_ports {mem_addr[4]}]
set_load -pin_load 0.0334 [get_ports {mem_addr[3]}]
set_load -pin_load 0.0334 [get_ports {mem_addr[2]}]
set_load -pin_load 0.0334 [get_ports {mem_addr[1]}]
set_load -pin_load 0.0334 [get_ports {mem_addr[0]}]
set_load -pin_load 0.0334 [get_ports {mem_din[7]}]
set_load -pin_load 0.0334 [get_ports {mem_din[6]}]
set_load -pin_load 0.0334 [get_ports {mem_din[5]}]
set_load -pin_load 0.0334 [get_ports {mem_din[4]}]
set_load -pin_load 0.0334 [get_ports {mem_din[3]}]
set_load -pin_load 0.0334 [get_ports {mem_din[2]}]
set_load -pin_load 0.0334 [get_ports {mem_din[1]}]
set_load -pin_load 0.0334 [get_ports {mem_din[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {start}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_dout[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_dout[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_dout[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_dout[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_dout[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_dout[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_dout[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_dout[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 10.0000 [current_design]
